{"stoi": {"22394": 0, "7766": 1, "29470": 2, "8562": 3, "7708": 4, "1381": 5, "13450": 6, "28558": 7, "18984": 8, "22457": 9, "14684": 10, "26678": 11, "29342": 12, "25155": 13, "13830": 14, "26800": 15, "19398": 16, "4831": 17, "24366": 18, "27345": 19, "22477": 20, "17289": 21, "17249": 22, "10975": 23, "10202": 24, "27468": 25, "8181": 26, "20767": 27, "24050": 28, "17595": 29, "9720": 30, "27679": 31, "18477": 32, "3207": 33, "11510": 34, "26224": 35, "2688": 36, "22702": 37, "14466": 38, "24597": 39, "7436": 40, "10872": 41, "4274": 42, "14191": 43, "29135": 44, "22528": 45, "4406": 46, "28264": 47, "15560": 48, "23031": 49, "21616": 50, "2394": 51, "27954": 52, "27030": 53, "10590": 54, "7154": 55, "24544": 56, "19612": 57, "26527": 58, "25152": 59, "21629": 60, "9214": 61, "2469": 62, "24203": 63, "12559": 64, "9315": 65, "8707": 66, "6405": 67, "9646": 68, "27518": 69, "15578": 70, "18886": 71, "25850": 72, "8147": 73, "18049": 74, "19295": 75, "17730": 76, "11645": 77, "26332": 78, "9535": 79, "15056": 80, "13001": 81, "27597": 82, "244": 83, "24723": 84, "17574": 85, "5923": 86, "11575": 87, "26846": 88, "28085": 89, "2321": 90, "5023": 91, "5494": 92, "23075": 93, "27698": 94, "8677": 95, "15793": 96, "28567": 97, "21692": 98, "27312": 99, "178": 100, "23685": 101, "21932": 102, "12110": 103, "4291": 104, "21825": 105, "3492": 106, "29335": 107, "21922": 108, "13289": 109, "27704": 110, "3418": 111, "23034": 112, "11539": 113, "10960": 114, "14227": 115, "12683": 116, "4172": 117, "5407": 118, "21103": 119, "15699": 120, "5268": 121, "6824": 122, "13703": 123, "29829": 124, "26988": 125, "22473": 126, "4584": 127, "4366": 128, "21602": 129, "17901": 130, "24851": 131, "8736": 132, "29690": 133, "9778": 134, "9174": 135, "17069": 136, "11678": 137, "2403": 138, "14259": 139, "5371": 140, "5670": 141, "28394": 142, "15095": 143, "24292": 144, "19609": 145, "4676": 146, "28249": 147, "12529": 148, "1443": 149, "2941": 150, "29369": 151, "20638": 152, "9372": 153, "23093": 154, "10576": 155, "20896": 156, "24848": 157, "9093": 158, "11748": 159, "14209": 160, "16720": 161, "18346": 162, "26564": 163, "731": 164, "7175": 165, "2315": 166, "23384": 167, "20900": 168, "27714": 169, "28216": 170, "13936": 171, "18203": 172, "8138": 173, "16912": 174, "23952": 175, "24877": 176, "21202": 177, "6325": 178, "5498": 179, "12842": 180, "29207": 181, "28751": 182, "5100": 183, "29134": 184, "28268": 185, "15410": 186, "24397": 187, "3186": 188, "29415": 189, "12614": 190, "12649": 191, "18698": 192, "7209": 193, "22758": 194, "10997": 195, "25114": 196, "3004": 197, "791": 198, "29609": 199, "6240": 200, "8630": 201, "20220": 202, "7525": 203, "5738": 204, "24706": 205, "4958": 206, "7651": 207, "15561": 208, "2625": 209, "13171": 210, "1310": 211, "21264": 212, "8066": 213, "24478": 214, "28514": 215, "17406": 216, "23969": 217, "23133": 218, "23115": 219, "11098": 220, "9932": 221, "24029": 222, "26376": 223, "15802": 224, "3558": 225, "14063": 226, "12972": 227, "24392": 228, "3423": 229, "26443": 230, "17389": 231, "26963": 232, "21535": 233, "27738": 234, "8412": 235, "11409": 236, "20115": 237, "26927": 238, "28407": 239, "13165": 240, "12461": 241, "4410": 242, "26172": 243, "19604": 244, "3681": 245, "4136": 246, "28022": 247, "2912": 248, "6851": 249, "11042": 250, "13394": 251, "27823": 252, "19162": 253, "5620": 254, "14047": 255, "7838": 256, "5345": 257, "28292": 258, "9910": 259, "15875": 260, "2275": 261, "15916": 262, "13383": 263, "12450": 264, "4664": 265, "20891": 266, "15655": 267, "8019": 268, "20011": 269, "21266": 270, "2923": 271, "10578": 272, "6184": 273, "925": 274, "6001": 275, "26711": 276, "10674": 277, "2177": 278, "20134": 279, "27191": 280, "4437": 281, "26909": 282, "11147": 283, "28156": 284, "9598": 285, "6103": 286, "18298": 287, "2049": 288, "23887": 289, "569": 290, "9195": 291, "12743": 292, "237": 293, "4608": 294, "25193": 295, "2568": 296, "15692": 297, "18634": 298, "6218": 299, "15577": 300, "17663": 301, "7504": 302, "8170": 303, "5409": 304, "6641": 305, "17581": 306, "8853": 307, "3422": 308, "13951": 309, "4935": 310, "10327": 311, "22874": 312, "18112": 313, "15382": 314, "11573": 315, "22927": 316, "20212": 317, "17308": 318, "2592": 319, "13557": 320, "4933": 321, "20200": 322, "3192": 323, "6287": 324, "19763": 325, "24805": 326, "18729": 327, "23607": 328, "3918": 329, "24511": 330, "25397": 331, "29290": 332, "19579": 333, "10773": 334, "5517": 335, "340": 336, "14088": 337, "2122": 338, "1595": 339, "14219": 340, "22116": 341, "18374": 342, "26725": 343, "3155": 344, "16094": 345, "26787": 346, "3325": 347, "11283": 348, "27353": 349, "4075": 350, "1780": 351, "6288": 352, "19797": 353, "16681": 354, "19138": 355, "2159": 356, "11741": 357, "4363": 358, "14667": 359, "10564": 360, "23595": 361, "9819": 362, "21391": 363, "15003": 364, "4967": 365, "11888": 366, "16828": 367, "9145": 368, "14861": 369, "17271": 370, "1487": 371, "23522": 372, "17178": 373, "27605": 374, "17569": 375, "26243": 376, "14433": 377, "5441": 378, "7055": 379, "19965": 380, "6419": 381, "25483": 382, "29183": 383, "17789": 384, "1429": 385, "4712": 386, "28549": 387, "10456": 388, "22237": 389, "22148": 390, "21911": 391, "9913": 392, "3231": 393, "224": 394, "16267": 395, "10565": 396, "8268": 397, "13186": 398, "24494": 399, "12111": 400, "9525": 401, "19129": 402, "6828": 403, "22974": 404, "16773": 405, "24282": 406, "16876": 407, "17839": 408, "12332": 409, "2187": 410, "15674": 411, "8050": 412, "9851": 413, "17174": 414, "10591": 415, "19819": 416, "4119": 417, "23159": 418, "16946": 419, "4815": 420, "26937": 421, "17895": 422, "18190": 423, "15812": 424, "3139": 425, "558": 426, "20853": 427, "20843": 428, "8343": 429, "25652": 430, "9119": 431, "1190": 432, "5739": 433, "22745": 434, "21201": 435, "11975": 436, "10124": 437, "22133": 438, "24354": 439, "24608": 440, "24609": 441, "22891": 442, "9469": 443, "16046": 444, "28020": 445, "9688": 446, "6306": 447, "24322": 448, "6864": 449, "21096": 450, "4107": 451, "21408": 452, "26099": 453, "7854": 454, "3397": 455, "19472": 456, "29904": 457, "3227": 458, "18558": 459, "10810": 460, "4680": 461, "28463": 462, "28911": 463, "23487": 464, "5426": 465, "7550": 466, "23667": 467, "21378": 468, "15336": 469, "26168": 470, "26996": 471, "6230": 472, "9700": 473, "27780": 474, "5331": 475, "21902": 476, "14173": 477, "13012": 478, "29497": 479, "4772": 480, "20383": 481, "646": 482, "5082": 483, "10545": 484, "29307": 485, "26213": 486, "10742": 487, "29746": 488, "23411": 489, "19281": 490, "7356": 491, "2131": 492, "2314": 493, "19952": 494, "26673": 495, "25705": 496, "23686": 497, "6168": 498, "6640": 499, "9443": 500, "7801": 501, "19557": 502, "3031": 503, "13325": 504, "26444": 505, "17885": 506, "20177": 507, "8762": 508, "24964": 509, "22798": 510, "17244": 511, "16081": 512, "16666": 513, "25334": 514, "2262": 515, "25566": 516, "10822": 517, "21185": 518, "26745": 519, "10304": 520, "25243": 521, "7350": 522, "25352": 523, "24278": 524, "15446": 525, "11694": 526, "16157": 527, "15987": 528, "23608": 529, "1299": 530, "7046": 531, "27411": 532, "28052": 533, "25863": 534, "24961": 535, "17229": 536, "10951": 537, "16053": 538, "1646": 539, "28083": 540, "17546": 541, "804": 542, "21099": 543, "24850": 544, "2346": 545, "17484": 546, "22431": 547, "19032": 548, "25316": 549, "3798": 550, "4518": 551, "17500": 552, "15614": 553, "28409": 554, "9166": 555, "5549": 556, "25043": 557, "29211": 558, "18964": 559, "19485": 560, "17186": 561, "8660": 562, "12344": 563, "27627": 564, "20858": 565, "20077": 566, "29296": 567, "964": 568, "19163": 569, "9441": 570, "16804": 571, "25033": 572, "3721": 573, "27979": 574, "24884": 575, "26551": 576, "24266": 577, "8697": 578, "27535": 579, "19582": 580, "17280": 581, "16990": 582, "3673": 583, "28062": 584, "9595": 585, "6217": 586, "29869": 587, "6182": 588, "14948": 589, "766": 590, "5066": 591, "15436": 592, "17233": 593, "28859": 594, "22310": 595, "17495": 596, "17656": 597, "24339": 598, "20830": 599, "3554": 600, "27419": 601, "2647": 602, "720": 603, "20345": 604, "17763": 605, "19378": 606, "15092": 607, "28471": 608, "29362": 609, "26355": 610, "15391": 611, "20058": 612, "22809": 613, "16209": 614, "7041": 615, "15064": 616, "22362": 617, "15771": 618, "2230": 619, "21191": 620, "16160": 621, "29037": 622, "6907": 623, "9192": 624, "68": 625, "29479": 626, "19141": 627, "6112": 628, "7295": 629, "18597": 630, "14609": 631, "15744": 632, "25836": 633, "7179": 634, "1477": 635, "2379": 636, "12432": 637, "20109": 638, "19643": 639, "29024": 640, "14544": 641, "472": 642, "23314": 643, "22439": 644, "24840": 645, "26421": 646, "18561": 647, "24739": 648, "19011": 649, "27481": 650, "29862": 651, "22410": 652, "15304": 653, "17974": 654, "23325": 655, "2526": 656, "369": 657, "29642": 658, "1566": 659, "19621": 660, "2851": 661, "11874": 662, "15603": 663, "8577": 664, "27836": 665, "4399": 666, "8563": 667, "3858": 668, "9784": 669, "21801": 670, "28618": 671, "1387": 672, "25989": 673, "8616": 674, "410": 675, "18068": 676, "27347": 677, "14469": 678, "15865": 679, "2559": 680, "17562": 681, "17584": 682, "11992": 683, "21957": 684, "24757": 685, "27283": 686, "23826": 687, "11206": 688, "16021": 689, "21716": 690, "26200": 691, "19817": 692, "20070": 693, "22844": 694, "24530": 695, "523": 696, "6404": 697, "13598": 698, "23635": 699, "23269": 700, "16859": 701, "20536": 702, "17411": 703, "10729": 704, "26901": 705, "15797": 706, "24598": 707, "24973": 708, "4976": 709, "21914": 710, "28179": 711, "6997": 712, "3328": 713, "24664": 714, "1773": 715, "21881": 716, "25812": 717, "18820": 718, "25477": 719, "159": 720, "26832": 721, "27262": 722, "6560": 723, "9184": 724, "25861": 725, "26736": 726, "14921": 727, "10097": 728, "29509": 729, "17074": 730, "18610": 731, "24627": 732, "14616": 733, "22261": 734, "13909": 735, "10501": 736, "22441": 737, "29231": 738, "27247": 739, "2834": 740, "1703": 741, "19165": 742, "13242": 743, "5071": 744, "23475": 745, "7081": 746, "1143": 747, "28255": 748, "12109": 749, "18516": 750, "4469": 751, "4262": 752, "4036": 753, "15068": 754, "23272": 755, "17653": 756, "687": 757, "29734": 758, "20243": 759, "8818": 760, "5922": 761, "29488": 762, "4471": 763, "23956": 764, "10856": 765, "17946": 766, "14039": 767, "15384": 768, "7398": 769, "27586": 770, "20391": 771, "23378": 772, "16607": 773, "9695": 774, "7379": 775, "23282": 776, "10414": 777, "809": 778, "10944": 779, "3532": 780, "25070": 781, "14835": 782, "5969": 783, "8185": 784, "3066": 785, "10103": 786, "20082": 787, "23078": 788, "22724": 789, "5791": 790, "2691": 791, "3122": 792, "27427": 793, "19577": 794, "15301": 795, "27504": 796, "482": 797, "14633": 798, "1255": 799, "19712": 800, "9297": 801, "11212": 802, "8393": 803, "3826": 804, "21271": 805, "26683": 806, "10458": 807, "16860": 808, "24662": 809, "17094": 810, "26928": 811, "18998": 812, "18393": 813, "3162": 814, "3209": 815, "7584": 816, "26489": 817, "28347": 818, "11970": 819, "28073": 820, "19368": 821, "29055": 822, "29623": 823, "14130": 824, "14204": 825, "27145": 826, "19487": 827, "25624": 828, "21303": 829, "13528": 830, "9701": 831, "9095": 832, "5637": 833, "20969": 834, "2058": 835, "26997": 836, "25178": 837, "2152": 838, "25735": 839, "20619": 840, "14000": 841, "10732": 842, "4506": 843, "26517": 844, "6856": 845, "21413": 846, "7184": 847, "19907": 848, "2280": 849, "12277": 850, "21544": 851, "28592": 852, "7565": 853, "10574": 854, "7972": 855, "8696": 856, "3788": 857, "10467": 858, "23540": 859, "1471": 860, "16713": 861, "2840": 862, "899": 863, "23545": 864, "14860": 865, "5829": 866, "20352": 867, "18688": 868, "18064": 869, "10704": 870, "25121": 871, "22233": 872, "28209": 873, "2979": 874, "15120": 875, "5725": 876, "22440": 877, "28417": 878, "9765": 879, "9044": 880, "9239": 881, "9391": 882, "27022": 883, "12922": 884, "22517": 885, "23708": 886, "9498": 887, "13815": 888, "10139": 889, "3695": 890, "12285": 891, "8935": 892, "9422": 893, "11907": 894, "17570": 895, "17707": 896, "28311": 897, "22152": 898, "5648": 899, "25713": 900, "22937": 901, "12418": 902, "20595": 903, "15162": 904, "8754": 905, "20341": 906, "9583": 907, "1136": 908, "24684": 909, "5213": 910, "16817": 911, "5085": 912, "13873": 913, "9459": 914, "25952": 915, "23815": 916, "26280": 917, "6308": 918, "16917": 919, "21386": 920, "24419": 921, "7066": 922, "26860": 923, "29180": 924, "29482": 925, "24646": 926, "13377": 927, "10811": 928, "22200": 929, "13628": 930, "9012": 931, "24274": 932, "24141": 933, "24079": 934, "4126": 935, "13000": 936, "21170": 937, "29424": 938, "27400": 939, "9709": 940, "12060": 941, "14325": 942, "19110": 943, "19827": 944, "18999": 945, "16334": 946, "29000": 947, "15800": 948, "26272": 949, "19256": 950, "6986": 951, "6470": 952, "24389": 953, "21291": 954, "20735": 955, "18127": 956, "25628": 957, "20183": 958, "28457": 959, "22508": 960, "15200": 961, "7489": 962, "8178": 963, "3540": 964, "25160": 965, "27054": 966, "7812": 967, "20822": 968, "21549": 969, "25996": 970, "16692": 971, "4359": 972, "5558": 973, "9333": 974, "12976": 975, "28888": 976, "16456": 977, "21628": 978, "21857": 979, "13137": 980, "14532": 981, "6143": 982, "25648": 983, "9844": 984, "10290": 985, "20075": 986, "17412": 987, "16714": 988, "18860": 989, "27902": 990, "10664": 991, "23528": 992, "22345": 993, "17913": 994, "24119": 995, "24054": 996, "17853": 997, "7660": 998, "23517": 999, "9219": 1000, "9831": 1001, "15389": 1002, "27046": 1003, "22795": 1004, "7423": 1005, "8159": 1006, "19776": 1007, "9423": 1008, "19997": 1009, "21241": 1010, "14001": 1011, "5138": 1012, "25290": 1013, "7621": 1014, "10398": 1015, "8406": 1016, "8188": 1017, "1576": 1018, "16366": 1019, "26899": 1020, "5532": 1021, "24398": 1022, "24694": 1023, "3495": 1024, "25673": 1025, "12675": 1026, "19168": 1027, "10896": 1028, "16778": 1029, "16028": 1030, "17145": 1031, "24232": 1032, "25945": 1033, "2129": 1034, "17061": 1035, "11481": 1036, "7776": 1037, "2986": 1038, "16899": 1039, "21827": 1040, "25901": 1041, "21328": 1042, "14601": 1043, "1437": 1044, "8351": 1045, "22191": 1046, "18421": 1047, "10474": 1048, "4319": 1049, "16064": 1050, "20296": 1051, "3137": 1052, "1734": 1053, "438": 1054, "16304": 1055, "3407": 1056, "24089": 1057, "5765": 1058, "9489": 1059, "5706": 1060, "746": 1061, "3757": 1062, "21065": 1063, "25415": 1064, "23086": 1065, "5795": 1066, "12760": 1067, "14103": 1068, "12152": 1069, "17942": 1070, "2491": 1071, "7115": 1072, "12412": 1073, "17461": 1074, "9346": 1075, "6311": 1076, "8270": 1077, "12837": 1078, "24716": 1079, "14198": 1080, "26581": 1081, "3094": 1082, "15116": 1083, "20446": 1084, "28848": 1085, "16418": 1086, "9342": 1087, "14717": 1088, "21674": 1089, "14132": 1090, "3118": 1091, "22496": 1092, "26026": 1093, "28473": 1094, "1017": 1095, "4361": 1096, "23817": 1097, "20176": 1098, "3039": 1099, "20897": 1100, "6031": 1101, "14452": 1102, "9300": 1103, "9959": 1104, "12910": 1105, "22503": 1106, "1912": 1107, "27721": 1108, "27723": 1109, "18880": 1110, "8395": 1111, "10326": 1112, "14281": 1113, "4724": 1114, "11524": 1115, "23898": 1116, "16599": 1117, "24508": 1118, "19234": 1119, "16199": 1120, "10952": 1121, "26892": 1122, "8189": 1123, "7214": 1124, "15911": 1125, "24895": 1126, "7012": 1127, "28294": 1128, "17650": 1129, "27793": 1130, "24560": 1131, "10295": 1132, "217": 1133, "12295": 1134, "6868": 1135, "16945": 1136, "3903": 1137, "13759": 1138, "20541": 1139, "15841": 1140, "8988": 1141, "25864": 1142, "28455": 1143, "25430": 1144, "26858": 1145, "9477": 1146, "22048": 1147, "25106": 1148, "29611": 1149, "6858": 1150, "12618": 1151, "18769": 1152, "12750": 1153, "8626": 1154, "15775": 1155, "20797": 1156, "7119": 1157, "2608": 1158, "28614": 1159, "10973": 1160, "18330": 1161, "16723": 1162, "21643": 1163, "14606": 1164, "17076": 1165, "16770": 1166, "14068": 1167, "14331": 1168, "2361": 1169, "3194": 1170, "19396": 1171, "20241": 1172, "10277": 1173, "16824": 1174, "22004": 1175, "15942": 1176, "2518": 1177, "12437": 1178, "15723": 1179, "20154": 1180, "7461": 1181, "25051": 1182, "23531": 1183, "13768": 1184, "9581": 1185, "18347": 1186, "16384": 1187, "27794": 1188, "22258": 1189, "7993": 1190, "20656": 1191, "17752": 1192, "23970": 1193, "17092": 1194, "9340": 1195, "17012": 1196, "4819": 1197, "7716": 1198, "23722": 1199, "24071": 1200, "23653": 1201, "1677": 1202, "11136": 1203, "26312": 1204, "28932": 1205, "14313": 1206, "28698": 1207, "23841": 1208, "10275": 1209, "10503": 1210, "14786": 1211, "14639": 1212, "17156": 1213, "20903": 1214, "27663": 1215, "6940": 1216, "15371": 1217, "2667": 1218, "7791": 1219, "5861": 1220, "1833": 1221, "13343": 1222, "26035": 1223, "28284": 1224, "28486": 1225, "15619": 1226, "22419": 1227, "27302": 1228, "26365": 1229, "27453": 1230, "12768": 1231, "25455": 1232, "13850": 1233, "1370": 1234, "21977": 1235, "4966": 1236, "13445": 1237, "27685": 1238, "9706": 1239, "2613": 1240, "16465": 1241, "219": 1242, "2886": 1243, "4556": 1244, "3691": 1245, "21873": 1246, "6718": 1247, "6929": 1248, "20437": 1249, "28845": 1250, "2206": 1251, "28187": 1252, "18241": 1253, "4411": 1254, "18418": 1255, "11805": 1256, "14898": 1257, "23977": 1258, "25291": 1259, "26046": 1260, "19093": 1261, "8750": 1262, "27183": 1263, "27098": 1264, "18394": 1265, "28286": 1266, "3923": 1267, "26016": 1268, "4418": 1269, "4141": 1270, "21640": 1271, "12229": 1272, "26715": 1273, "24697": 1274, "15255": 1275, "18125": 1276, "26980": 1277, "14851": 1278, "23179": 1279, "20330": 1280, "16689": 1281, "28346": 1282, "71": 1283, "3560": 1284, "11397": 1285, "4125": 1286, "27390": 1287, "24464": 1288, "11736": 1289, "13369": 1290, "6074": 1291, "7207": 1292, "11358": 1293, "26060": 1294, "12917": 1295, "2481": 1296, "11856": 1297, "13630": 1298, "18961": 1299, "23139": 1300, "29587": 1301, "11709": 1302, "6877": 1303, "2725": 1304, "19179": 1305, "25711": 1306, "8643": 1307, "7324": 1308, "502": 1309, "2020": 1310, "27348": 1311, "16540": 1312, "6963": 1313, "22551": 1314, "25260": 1315, "18824": 1316, "6726": 1317, "21879": 1318, "4624": 1319, "15519": 1320, "1294": 1321, "23174": 1322, "133": 1323, "22686": 1324, "4894": 1325, "5196": 1326, "9374": 1327, "21584": 1328, "2502": 1329, "184": 1330, "8126": 1331, "29384": 1332, "16579": 1333, "12832": 1334, "25456": 1335, "16547": 1336, "13151": 1337, "26017": 1338, "12424": 1339, "24946": 1340, "6068": 1341, "22606": 1342, "26944": 1343, "7570": 1344, "29298": 1345, "3458": 1346, "22971": 1347, "27889": 1348, "20511": 1349, "10499": 1350, "13606": 1351, "17483": 1352, "20937": 1353, "20811": 1354, "22019": 1355, "15554": 1356, "9006": 1357, "25344": 1358, "25772": 1359, "2258": 1360, "28566": 1361, "27562": 1362, "7692": 1363, "19735": 1364, "6976": 1365, "15592": 1366, "20526": 1367, "12210": 1368, "26464": 1369, "26931": 1370, "19146": 1371, "24962": 1372, "24187": 1373, "6823": 1374, "10868": 1375, "422": 1376, "2136": 1377, "29022": 1378, "15511": 1379, "29472": 1380, "28933": 1381, "27103": 1382, "20551": 1383, "29749": 1384, "8409": 1385, "9606": 1386, "12480": 1387, "2414": 1388, "26484": 1389, "1671": 1390, "29013": 1391, "7806": 1392, "14007": 1393, "20779": 1394, "19263": 1395, "24010": 1396, "20489": 1397, "27998": 1398, "21948": 1399, "25143": 1400, "4857": 1401, "20258": 1402, "18562": 1403, "16667": 1404, "13783": 1405, "22723": 1406, "21882": 1407, "26693": 1408, "11726": 1409, "26815": 1410, "28252": 1411, "7693": 1412, "25595": 1413, "11184": 1414, "28227": 1415, "19586": 1416, "23625": 1417, "15468": 1418, "11717": 1419, "9710": 1420, "29924": 1421, "8335": 1422, "22564": 1423, "19650": 1424, "2272": 1425, "14857": 1426, "500": 1427, "19939": 1428, "16100": 1429, "28678": 1430, "16385": 1431, "11784": 1432, "15845": 1433, "21150": 1434, "19151": 1435, "22006": 1436, "6463": 1437, "16986": 1438, "17564": 1439, "11279": 1440, "23439": 1441, "23267": 1442, "5577": 1443, "4360": 1444, "21494": 1445, "20053": 1446, "2758": 1447, "18793": 1448, "24749": 1449, "16535": 1450, "6361": 1451, "8549": 1452, "16266": 1453, "9908": 1454, "7340": 1455, "653": 1456, "18461": 1457, "8303": 1458, "10485": 1459, "12533": 1460, "19752": 1461, "3438": 1462, "27918": 1463, "23894": 1464, "21933": 1465, "8024": 1466, "16238": 1467, "27063": 1468, "9923": 1469, "1961": 1470, "10294": 1471, "4560": 1472, "20257": 1473, "15894": 1474, "13424": 1475, "7457": 1476, "1064": 1477, "15429": 1478, "13271": 1479, "2033": 1480, "11340": 1481, "8133": 1482, "10260": 1483, "8575": 1484, "10371": 1485, "20283": 1486, "20378": 1487, "23799": 1488, "18071": 1489, "18564": 1490, "24903": 1491, "966": 1492, "25111": 1493, "921": 1494, "6157": 1495, "3524": 1496, "19925": 1497, "29513": 1498, "12733": 1499, "11153": 1500, "3224": 1501, "681": 1502, "1888": 1503, "10950": 1504, "15546": 1505, "3606": 1506, "15622": 1507, "27059": 1508, "26738": 1509, "24057": 1510, "5628": 1511, "29719": 1512, "8332": 1513, "2847": 1514, "3594": 1515, "28630": 1516, "29821": 1517, "13439": 1518, "27689": 1519, "19084": 1520, "8990": 1521, "23250": 1522, "16855": 1523, "29577": 1524, "7750": 1525, "9553": 1526, "4279": 1527, "10254": 1528, "17887": 1529, "25358": 1530, "19266": 1531, "28161": 1532, "21867": 1533, "3429": 1534, "5576": 1535, "9141": 1536, "18953": 1537, "1112": 1538, "13107": 1539, "17844": 1540, "4629": 1541, "14655": 1542, "9056": 1543, "1413": 1544, "16543": 1545, "14323": 1546, "23367": 1547, "21426": 1548, "10761": 1549, "28176": 1550, "29552": 1551, "27475": 1552, "16004": 1553, "8312": 1554, "23569": 1555, "18174": 1556, "13825": 1557, "4586": 1558, "16968": 1559, "15677": 1560, "21518": 1561, "8743": 1562, "4298": 1563, "3768": 1564, "18020": 1565, "22834": 1566, "12968": 1567, "22690": 1568, "7910": 1569, "10650": 1570, "4186": 1571, "5422": 1572, "29704": 1573, "22525": 1574, "12744": 1575, "7842": 1576, "18439": 1577, "10696": 1578, "15005": 1579, "10368": 1580, "9716": 1581, "14142": 1582, "5612": 1583, "7841": 1584, "23691": 1585, "11525": 1586, "8016": 1587, "5157": 1588, "5789": 1589, "8518": 1590, "27957": 1591, "10957": 1592, "19724": 1593, "24030": 1594, "15893": 1595, "8423": 1596, "17276": 1597, "1975": 1598, "26505": 1599, "20837": 1600, "7181": 1601, "29514": 1602, "27799": 1603, "8483": 1604, "25234": 1605, "574": 1606, "21569": 1607, "8728": 1608, "8272": 1609, "21837": 1610, "10378": 1611, "24615": 1612, "20684": 1613, "10031": 1614, "24747": 1615, "8227": 1616, "20968": 1617, "6236": 1618, "4561": 1619, "16502": 1620, "28151": 1621, "22105": 1622, "24291": 1623, "9128": 1624, "22828": 1625, "14028": 1626, "11216": 1627, "21377": 1628, "510": 1629, "14563": 1630, "3861": 1631, "4694": 1632, "18179": 1633, "9055": 1634, "14775": 1635, "12316": 1636, "12989": 1637, "23701": 1638, "16482": 1639, "6262": 1640, "2138": 1641, "17399": 1642, "4476": 1643, "6621": 1644, "4461": 1645, "28764": 1646, "1195": 1647, "29693": 1648, "18525": 1649, "26038": 1650, "6770": 1651, "15232": 1652, "10579": 1653, "12448": 1654, "25902": 1655, "13619": 1656, "20312": 1657, "12596": 1658, "6301": 1659, "5691": 1660, "13446": 1661, "1803": 1662, "27633": 1663, "9789": 1664, "16222": 1665, "11086": 1666, "28157": 1667, "28202": 1668, "19342": 1669, "4384": 1670, "17850": 1671, "15950": 1672, "27323": 1673, "22466": 1674, "23858": 1675, "5204": 1676, "14982": 1677, "28078": 1678, "29507": 1679, "24433": 1680, "16386": 1681, "18591": 1682, "15724": 1683, "23864": 1684, "27497": 1685, "13005": 1686, "16195": 1687, "5749": 1688, "23405": 1689, "4165": 1690, "239": 1691, "24255": 1692, "19251": 1693, "18327": 1694, "9123": 1695, "29487": 1696, "24473": 1697, "22592": 1698, "12309": 1699, "9863": 1700, "816": 1701, "26133": 1702, "20390": 1703, "9217": 1704, "6362": 1705, "29676": 1706, "12946": 1707, "14577": 1708, "21713": 1709, "10926": 1710, "26053": 1711, "12244": 1712, "19231": 1713, "25425": 1714, "26203": 1715, "20600": 1716, "7748": 1717, "15977": 1718, "628": 1719, "27476": 1720, "8285": 1721, "3087": 1722, "23551": 1723, "18102": 1724, "1581": 1725, "5451": 1726, "18627": 1727, "5849": 1728, "4155": 1729, "5112": 1730, "3700": 1731, "26216": 1732, "12906": 1733, "16188": 1734, "27014": 1735, "4409": 1736, "8377": 1737, "10022": 1738, "25509": 1739, "19455": 1740, "25958": 1741, "1033": 1742, "9600": 1743, "5906": 1744, "8497": 1745, "12498": 1746, "11070": 1747, "1693": 1748, "10086": 1749, "28021": 1750, "12267": 1751, "13331": 1752, "23834": 1753, "14445": 1754, "6993": 1755, "13898": 1756, "4924": 1757, "10803": 1758, "4773": 1759, "10128": 1760, "22316": 1761, "22967": 1762, "22456": 1763, "8794": 1764, "16594": 1765, "15343": 1766, "6060": 1767, "7609": 1768, "9699": 1769, "25225": 1770, "12660": 1771, "3541": 1772, "4790": 1773, "6535": 1774, "4332": 1775, "7719": 1776, "562": 1777, "2693": 1778, "29450": 1779, "2354": 1780, "5233": 1781, "4828": 1782, "4101": 1783, "14738": 1784, "26905": 1785, "5785": 1786, "27112": 1787, "24214": 1788, "9612": 1789, "25325": 1790, "16307": 1791, "25740": 1792, "24035": 1793, "2514": 1794, "26500": 1795, "12001": 1796, "24581": 1797, "25470": 1798, "1758": 1799, "1771": 1800, "1297": 1801, "9376": 1802, "15833": 1803, "16443": 1804, "26850": 1805, "2926": 1806, "16585": 1807, "2324": 1808, "28586": 1809, "16353": 1810, "28183": 1811, "24582": 1812, "1052": 1813, "25684": 1814, "23235": 1815, "15634": 1816, "28155": 1817, "10791": 1818, "11244": 1819, "9891": 1820, "8099": 1821, "15071": 1822, "24542": 1823, "12789": 1824, "27614": 1825, "11180": 1826, "19149": 1827, "3223": 1828, "26690": 1829, "3815": 1830, "22043": 1831, "28673": 1832, "4011": 1833, "1946": 1834, "21445": 1835, "14941": 1836, "9929": 1837, "722": 1838, "6066": 1839, "26624": 1840, "27171": 1841, "26219": 1842, "23263": 1843, "7773": 1844, "27575": 1845, "11745": 1846, "514": 1847, "29259": 1848, "22518": 1849, "23210": 1850, "664": 1851, "20852": 1852, "13395": 1853, "3067": 1854, "23150": 1855, "14099": 1856, "18731": 1857, "27412": 1858, "7129": 1859, "15299": 1860, "8902": 1861, "7360": 1862, "6172": 1863, "16668": 1864, "4175": 1865, "21558": 1866, "7826": 1867, "29092": 1868, "11816": 1869, "6643": 1870, "10396": 1871, "5966": 1872, "20315": 1873, "17441": 1874, "8767": 1875, "26900": 1876, "25409": 1877, "4764": 1878, "21993": 1879, "6146": 1880, "21054": 1881, "17409": 1882, "27715": 1883, "12482": 1884, "16693": 1885, "6727": 1886, "28245": 1887, "20232": 1888, "13113": 1889, "14311": 1890, "26933": 1891, "19242": 1892, "19074": 1893, "929": 1894, "8056": 1895, "11664": 1896, "20742": 1897, "27498": 1898, "1029": 1899, "4610": 1900, "172": 1901, "29091": 1902, "24405": 1903, "15864": 1904, "25006": 1905, "5063": 1906, "23102": 1907, "17594": 1908, "8557": 1909, "6082": 1910, "5750": 1911, "19868": 1912, "8791": 1913, "25268": 1914, "24358": 1915, "25852": 1916, "17396": 1917, "1000": 1918, "6844": 1919, "12330": 1920, "2863": 1921, "16698": 1922, "13194": 1923, "22917": 1924, "19805": 1925, "7715": 1926, "1564": 1927, "10104": 1928, "8194": 1929, "14602": 1930, "28674": 1931, "27905": 1932, "3179": 1933, "14712": 1934, "12818": 1935, "18313": 1936, "4515": 1937, "18786": 1938, "12284": 1939, "22644": 1940, "26242": 1941, "24240": 1942, "23843": 1943, "25732": 1944, "29425": 1945, "21344": 1946, "460": 1947, "21475": 1948, "16233": 1949, "13739": 1950, "18225": 1951, "4208": 1952, "397": 1953, "21953": 1954, "1405": 1955, "27734": 1956, "9626": 1957, "19665": 1958, "15454": 1959, "12429": 1960, "6745": 1961, "18098": 1962, "23868": 1963, "13952": 1964, "28412": 1965, "15985": 1966, "28773": 1967, "14979": 1968, "9024": 1969, "10282": 1970, "23889": 1971, "13207": 1972, "18118": 1973, "23389": 1974, "14520": 1975, "22292": 1976, "25342": 1977, "15617": 1978, "20417": 1979, "1342": 1980, "28158": 1981, "20603": 1982, "16631": 1983, "19853": 1984, "18251": 1985, "10783": 1986, "12270": 1987, "13407": 1988, "28927": 1989, "90": 1990, "29185": 1991, "29875": 1992, "14831": 1993, "2102": 1994, "12624": 1995, "28791": 1996, "20549": 1997, "12181": 1998, "17196": 1999, "23338": 2000, "10539": 2001, "18357": 2002, "23985": 2003, "21860": 2004, "13615": 2005, "4392": 2006, "15993": 2007, "8687": 2008, "10959": 2009, "12589": 2010, "1032": 2011, "24036": 2012, "4835": 2013, "15144": 2014, "2332": 2015, "1854": 2016, "10314": 2017, "17426": 2018, "14820": 2019, "16586": 2020, "25695": 2021, "26993": 2022, "12901": 2023, "9826": 2024, "886": 2025, "13599": 2026, "15394": 2027, "9433": 2028, "22268": 2029, "5832": 2030, "10036": 2031, "11818": 2032, "18725": 2033, "1030": 2034, "18584": 2035, "14894": 2036, "18218": 2037, "29639": 2038, "1309": 2039, "28411": 2040, "29860": 2041, "1794": 2042, "6422": 2043, "8914": 2044, "4243": 2045, "26404": 2046, "23469": 2047, "7944": 2048, "10305": 2049, "4350": 2050, "19338": 2051, "17737": 2052, "6602": 2053, "1899": 2054, "2344": 2055, "24117": 2056, "19086": 2057, "22293": 2058, "18356": 2059, "2048": 2060, "7626": 2061, "21548": 2062, "18079": 2063, "12147": 2064, "18717": 2065, "28140": 2066, "347": 2067, "5988": 2068, "16196": 2069, "2164": 2070, "12272": 2071, "28498": 2072, "16036": 2073, "1257": 2074, "17176": 2075, "13975": 2076, "17392": 2077, "10746": 2078, "21660": 2079, "28892": 2080, "26261": 2081, "6840": 2082, "18632": 2083, "5375": 2084, "703": 2085, "13769": 2086, "169": 2087, "5526": 2088, "20912": 2089, "4470": 2090, "26520": 2091, "13945": 2092, "15510": 2093, "8610": 2094, "17583": 2095, "2665": 2096, "22880": 2097, "23519": 2098, "506": 2099, "4027": 2100, "29625": 2101, "3258": 2102, "4429": 2103, "17313": 2104, "23777": 2105, "3893": 2106, "27539": 2107, "5650": 2108, "12897": 2109, "2398": 2110, "9686": 2111, "8082": 2112, "8342": 2113, "19644": 2114, "22984": 2115, "2072": 2116, "24106": 2117, "25841": 2118, "9356": 2119, "23320": 2120, "17929": 2121, "13862": 2122, "28383": 2123, "24737": 2124, "21308": 2125, "21154": 2126, "5373": 2127, "9570": 2128, "19991": 2129, "15239": 2130, "23504": 2131, "1288": 2132, "4599": 2133, "6244": 2134, "16587": 2135, "8554": 2136, "501": 2137, "4444": 2138, "9171": 2139, "20652": 2140, "21796": 2141, "26569": 2142, "1194": 2143, "4786": 2144, "8954": 2145, "28722": 2146, "24813": 2147, "15495": 2148, "26752": 2149, "24406": 2150, "1439": 2151, "22110": 2152, "21435": 2153, "8919": 2154, "5094": 2155, "6809": 2156, "12643": 2157, "13174": 2158, "24506": 2159, "24288": 2160, "6743": 2161, "15799": 2162, "23518": 2163, "4201": 2164, "12022": 2165, "20506": 2166, "8674": 2167, "3629": 2168, "26414": 2169, "23464": 2170, "21329": 2171, "28204": 2172, "13147": 2173, "19298": 2174, "23733": 2175, "3833": 2176, "1896": 2177, "10504": 2178, "903": 2179, "20986": 2180, "2211": 2181, "18468": 2182, "23944": 2183, "9178": 2184, "23666": 2185, "24476": 2186, "25769": 2187, "23534": 2188, "10987": 2189, "29849": 2190, "10262": 2191, "25419": 2192, "9335": 2193, "7589": 2194, "7332": 2195, "18892": 2196, "27834": 2197, "2027": 2198, "15469": 2199, "24856": 2200, "2798": 2201, "12784": 2202, "24774": 2203, "22008": 2204, "22125": 2205, "22549": 2206, "13403": 2207, "28687": 2208, "29449": 2209, "8251": 2210, "5302": 2211, "5298": 2212, "5325": 2213, "12": 2214, "14483": 2215, "25457": 2216, "22290": 2217, "708": 2218, "24910": 2219, "17629": 2220, "18910": 2221, "3335": 2222, "9735": 2223, "17136": 2224, "3794": 2225, "10081": 2226, "22197": 2227, "1999": 2228, "10756": 2229, "191": 2230, "6895": 2231, "15222": 2232, "21938": 2233, "12851": 2234, "23774": 2235, "29309": 2236, "7798": 2237, "5314": 2238, "4378": 2239, "17281": 2240, "19610": 2241, "22540": 2242, "27534": 2243, "13243": 2244, "16489": 2245, "16662": 2246, "7545": 2247, "6476": 2248, "10137": 2249, "19069": 2250, "8204": 2251, "23132": 2252, "26156": 2253, "7579": 2254, "13967": 2255, "4616": 2256, "14723": 2257, "20350": 2258, "28637": 2259, "3821": 2260, "8100": 2261, "23652": 2262, "28970": 2263, "12466": 2264, "2862": 2265, "2751": 2266, "2067": 2267, "21631": 2268, "21052": 2269, "5540": 2270, "13479": 2271, "18138": 2272, "27657": 2273, "619": 2274, "19267": 2275, "10120": 2276, "16243": 2277, "18941": 2278, "16394": 2279, "17264": 2280, "9208": 2281, "12925": 2282, "10939": 2283, "21917": 2284, "27707": 2285, "187": 2286, "6008": 2287, "5350": 2288, "11329": 2289, "5332": 2290, "28849": 2291, "5983": 2292, "17171": 2293, "5860": 2294, "15935": 2295, "6504": 2296, "17348": 2297, "21793": 2298, "25048": 2299, "29273": 2300, "8162": 2301, "10180": 2302, "14411": 2303, "14125": 2304, "3107": 2305, "9170": 2306, "26349": 2307, "21546": 2308, "23259": 2309, "15073": 2310, "28897": 2311, "21614": 2312, "13795": 2313, "9911": 2314, "3579": 2315, "18280": 2316, "11271": 2317, "22822": 2318, "14958": 2319, "28835": 2320, "26987": 2321, "20038": 2322, "11467": 2323, "16310": 2324, "14389": 2325, "3124": 2326, "7141": 2327, "18230": 2328, "27826": 2329, "26535": 2330, "26498": 2331, "4316": 2332, "27397": 2333, "23436": 2334, "5064": 2335, "6327": 2336, "16192": 2337, "22392": 2338, "24115": 2339, "25410": 2340, "2158": 2341, "26068": 2342, "27892": 2343, "1105": 2344, "10341": 2345, "10947": 2346, "840": 2347, "29771": 2348, "28817": 2349, "51": 2350, "8167": 2351, "21477": 2352, "25544": 2353, "18168": 2354, "10232": 2355, "18876": 2356, "11547": 2357, "21133": 2358, "23182": 2359, "22088": 2360, "579": 2361, "21178": 2362, "14076": 2363, "7202": 2364, "8570": 2365, "18887": 2366, "9113": 2367, "25287": 2368, "26122": 2369, "26117": 2370, "5989": 2371, "8278": 2372, "25981": 2373, "24304": 2374, "24346": 2375, "16583": 2376, "1363": 2377, "22605": 2378, "17341": 2379, "25375": 2380, "25929": 2381, "23767": 2382, "18997": 2383, "16234": 2384, "4814": 2385, "6598": 2386, "29294": 2387, "15545": 2388, "28780": 2389, "5478": 2390, "9576": 2391, "23247": 2392, "22832": 2393, "650": 2394, "4270": 2395, "19345": 2396, "11505": 2397, "26828": 2398, "24345": 2399, "20841": 2400, "14871": 2401, "3084": 2402, "27869": 2403, "14226": 2404, "17245": 2405, "296": 2406, "28323": 2407, "4443": 2408, "6741": 2409, "27628": 2410, "3280": 2411, "29102": 2412, "12130": 2413, "7344": 2414, "29502": 2415, "12788": 2416, "20107": 2417, "17093": 2418, "14791": 2419, "7820": 2420, "23446": 2421, "27277": 2422, "2651": 2423, "26972": 2424, "24186": 2425, "5386": 2426, "26041": 2427, "24466": 2428, "25413": 2429, "3793": 2430, "8488": 2431, "20872": 2432, "24931": 2433, "10475": 2434, "15870": 2435, "28185": 2436, "19273": 2437, "5957": 2438, "6294": 2439, "20271": 2440, "25461": 2441, "6679": 2442, "8628": 2443, "16626": 2444, "11850": 2445, "29250": 2446, "1731": 2447, "25654": 2448, "2472": 2449, "10710": 2450, "22016": 2451, "26680": 2452, "13364": 2453, "9284": 2454, "15890": 2455, "181": 2456, "24852": 2457, "1019": 2458, "1672": 2459, "19279": 2460, "8796": 2461, "21961": 2462, "23907": 2463, "24890": 2464, "21536": 2465, "27641": 2466, "16609": 2467, "723": 2468, "9609": 2469, "24173": 2470, "26058": 2471, "20994": 2472, "27509": 2473, "154": 2474, "22201": 2475, "11135": 2476, "13776": 2477, "9513": 2478, "8590": 2479, "16637": 2480, "3882": 2481, "5337": 2482, "13490": 2483, "23669": 2484, "17565": 2485, "999": 2486, "17781": 2487, "15496": 2488, "13347": 2489, "11221": 2490, "28665": 2491, "20191": 2492, "2483": 2493, "17591": 2494, "1174": 2495, "28707": 2496, "7035": 2497, "14064": 2498, "4533": 2499, "19446": 2500, "23922": 2501, "26607": 2502, "19348": 2503, "17699": 2504, "912": 2505, "2477": 2506, "20276": 2507, "2544": 2508, "10708": 2509, "9602": 2510, "24580": 2511, "29367": 2512, "25988": 2513, "10958": 2514, "5105": 2515, "9740": 2516, "20225": 2517, "4768": 2518, "21746": 2519, "3523": 2520, "441": 2521, "15479": 2522, "4133": 2523, "11324": 2524, "386": 2525, "23771": 2526, "9453": 2527, "3616": 2528, "4854": 2529, "19654": 2530, "16433": 2531, "139": 2532, "16249": 2533, "1268": 2534, "18195": 2535, "13371": 2536, "26222": 2537, "8701": 2538, "12293": 2539, "20286": 2540, "15332": 2541, "11911": 2542, "7588": 2543, "17368": 2544, "2906": 2545, "26510": 2546, "22090": 2547, "6568": 2548, "26501": 2549, "10431": 2550, "19637": 2551, "19649": 2552, "20366": 2553, "8778": 2554, "968": 2555, "23008": 2556, "5968": 2557, "21521": 2558, "22526": 2559, "12680": 2560, "1811": 2561, "6756": 2562, "16191": 2563, "15781": 2564, "1592": 2565, "12502": 2566, "9823": 2567, "23265": 2568, "14238": 2569, "12693": 2570, "9670": 2571, "7299": 2572, "20327": 2573, "20832": 2574, "25651": 2575, "24568": 2576, "24761": 2577, "25416": 2578, "12083": 2579, "1902": 2580, "5442": 2581, "20825": 2582, "4592": 2583, "3396": 2584, "2686": 2585, "3052": 2586, "20239": 2587, "12869": 2588, "18333": 2589, "1681": 2590, "5057": 2591, "14561": 2592, "23203": 2593, "9538": 2594, "27185": 2595, "7977": 2596, "23481": 2597, "15970": 2598, "1107": 2599, "17544": 2600, "13881": 2601, "17758": 2602, "18116": 2603, "1104": 2604, "5672": 2605, "1460": 2606, "17874": 2607, "27640": 2608, "3331": 2609, "15189": 2610, "2537": 2611, "25913": 2612, "21457": 2613, "5746": 2614, "29981": 2615, "26370": 2616, "943": 2617, "16080": 2618, "23532": 2619, "22459": 2620, "1812": 2621, "13093": 2622, "22108": 2623, "12018": 2624, "23095": 2625, "27688": 2626, "27053": 2627, "23157": 2628, "8973": 2629, "14023": 2630, "24070": 2631, "27936": 2632, "253": 2633, "24766": 2634, "5366": 2635, "18626": 2636, "16131": 2637, "26791": 2638, "19662": 2639, "14050": 2640, "21060": 2641, "8878": 2642, "26141": 2643, "10186": 2644, "2909": 2645, "5663": 2646, "12081": 2647, "17395": 2648, "5176": 2649, "21798": 2650, "12506": 2651, "18039": 2652, "26186": 2653, "14919": 2654, "26964": 2655, "14729": 2656, "12988": 2657, "26651": 2658, "27485": 2659, "5081": 2660, "8124": 2661, "6117": 2662, "5069": 2663, "11254": 2664, "27985": 2665, "17381": 2666, "26196": 2667, "12763": 2668, "12351": 2669, "27718": 2670, "18033": 2671, "28465": 2672, "10546": 2673, "22624": 2674, "18399": 2675, "9496": 2676, "17462": 2677, "182": 2678, "29972": 2679, "10169": 2680, "8102": 2681, "29466": 2682, "9962": 2683, "21215": 2684, "3947": 2685, "13082": 2686, "1916": 2687, "16510": 2688, "9658": 2689, "27414": 2690, "6603": 2691, "1071": 2692, "20494": 2693, "19360": 2694, "20827": 2695, "26853": 2696, "5633": 2697, "8711": 2698, "21797": 2699, "29414": 2700, "5410": 2701, "9015": 2702, "12527": 2703, "22250": 2704, "19000": 2705, "1660": 2706, "7836": 2707, "17098": 2708, "4882": 2709, "18169": 2710, "25752": 2711, "23187": 2712, "24552": 2713, "27477": 2714, "27322": 2715, "18768": 2716, "469": 2717, "13778": 2718, "29743": 2719, "14417": 2720, "17482": 2721, "7678": 2722, "28939": 2723, "25450": 2724, "18263": 2725, "4267": 2726, "7089": 2727, "14652": 2728, "17662": 2729, "8861": 2730, "10111": 2731, "17081": 2732, "26148": 2733, "28012": 2734, "12773": 2735, "15625": 2736, "22982": 2737, "8825": 2738, "22224": 2739, "22799": 2740, "26765": 2741, "23661": 2742, "26797": 2743, "4292": 2744, "11778": 2745, "23059": 2746, "5450": 2747, "7441": 2748, "14222": 2749, "10318": 2750, "18403": 2751, "25067": 2752, "17523": 2753, "5826": 2754, "24806": 2755, "13753": 2756, "29628": 2757, "9293": 2758, "25072": 2759, "2954": 2760, "28497": 2761, "23863": 2762, "1272": 2763, "5874": 2764, "13257": 2765, "29023": 2766, "12628": 2767, "13262": 2768, "6897": 2769, "12697": 2770, "547": 2771, "6999": 2772, "23832": 2773, "22054": 2774, "11020": 2775, "16357": 2776, "23643": 2777, "19994": 2778, "2580": 2779, "6420": 2780, "27158": 2781, "19995": 2782, "17157": 2783, "1446": 2784, "6914": 2785, "29803": 2786, "29648": 2787, "8544": 2788, "11172": 2789, "29299": 2790, "11616": 2791, "11061": 2792, "16033": 2793, "14588": 2794, "11013": 2795, "9977": 2796, "20266": 2797, "5980": 2798, "13636": 2799, "3178": 2800, "21040": 2801, "15682": 2802, "16169": 2803, "4883": 2804, "7148": 2805, "28236": 2806, "3205": 2807, "9073": 2808, "9711": 2809, "24078": 2810, "2981": 2811, "27033": 2812, "17886": 2813, "5928": 2814, "5769": 2815, "1921": 2816, "928": 2817, "14832": 2818, "29861": 2819, "17966": 2820, "27147": 2821, "3450": 2822, "6259": 2823, "12966": 2824, "2883": 2825, "10046": 2826, "1139": 2827, "11686": 2828, "16114": 2829, "16590": 2830, "22397": 2831, "24103": 2832, "455": 2833, "25607": 2834, "15526": 2835, "24763": 2836, "437": 2837, "26077": 2838, "7333": 2839, "28750": 2840, "2323": 2841, "22093": 2842, "17760": 2843, "29668": 2844, "27172": 2845, "4076": 2846, "21345": 2847, "8528": 2848, "29453": 2849, "4116": 2850, "9702": 2851, "24635": 2852, "26399": 2853, "22413": 2854, "9814": 2855, "20392": 2856, "9352": 2857, "16002": 2858, "18140": 2859, "8801": 2860, "2742": 2861, "27162": 2862, "7500": 2863, "10044": 2864, "18695": 2865, "17955": 2866, "22391": 2867, "25360": 2868, "1284": 2869, "25633": 2870, "10915": 2871, "94": 2872, "24974": 2873, "12531": 2874, "27585": 2875, "22839": 2876, "12573": 2877, "1619": 2878, "5457": 2879, "27190": 2880, "14683": 2881, "29284": 2882, "1522": 2883, "4971": 2884, "9988": 2885, "16050": 2886, "4728": 2887, "7323": 2888, "22649": 2889, "22342": 2890, "12803": 2891, "22910": 2892, "25600": 2893, "28469": 2894, "29524": 2895, "9543": 2896, "3931": 2897, "28526": 2898, "8376": 2899, "26477": 2900, "4073": 2901, "22819": 2902, "14510": 2903, "23509": 2904, "17571": 2905, "9665": 2906, "1870": 2907, "13229": 2908, "24765": 2909, "3484": 2910, "11302": 2911, "4715": 2912, "24135": 2913, "17719": 2914, "12873": 2915, "21806": 2916, "23468": 2917, "28337": 2918, "10108": 2919, "16815": 2920, "19432": 2921, "29852": 2922, "10802": 2923, "13028": 2924, "10173": 2925, "27656": 2926, "22996": 2927, "29114": 2928, "16655": 2929, "7225": 2930, "14872": 2931, "17533": 2932, "13482": 2933, "29101": 2934, "27108": 2935, "4875": 2936, "7871": 2937, "16606": 2938, "3185": 2939, "25336": 2940, "13950": 2941, "27154": 2942, "20046": 2943, "7034": 2944, "15859": 2945, "11572": 2946, "2929": 2947, "5855": 2948, "28667": 2949, "3018": 2950, "17788": 2951, "4794": 2952, "25517": 2953, "19380": 2954, "8385": 2955, "149": 2956, "2246": 2957, "6358": 2958, "16721": 2959, "22541": 2960, "5397": 2961, "28112": 2962, "12312": 2963, "1967": 2964, "19104": 2965, "29090": 2966, "20925": 2967, "15412": 2968, "26925": 2969, "17077": 2970, "18034": 2971, "10962": 2972, "246": 2973, "9476": 2974, "15871": 2975, "1674": 2976, "6755": 2977, "26287": 2978, "6192": 2979, "10059": 2980, "2117": 2981, "6794": 2982, "9415": 2983, "18547": 2984, "22336": 2985, "18823": 2986, "13916": 2987, "24294": 2988, "18165": 2989, "11848": 2990, "3962": 2991, "26209": 2992, "29327": 2993, "9236": 2994, "16474": 2995, "5963": 2996, "13879": 2997, "12190": 2998, "3189": 2999, "14262": 3000, "22445": 3001, "22992": 3002, "28084": 3003, "15016": 3004, "6919": 3005, "11672": 3006, "15941": 3007, "21886": 3008, "27374": 3009, "18213": 3010, "6154": 3011, "14075": 3012, "20975": 3013, "14599": 3014, "918": 3015, "27380": 3016, "23496": 3017, "5847": 3018, "12771": 3019, "16661": 3020, "2461": 3021, "1198": 3022, "15693": 3023, "13073": 3024, "7188": 3025, "6078": 3026, "7979": 3027, "20495": 3028, "9414": 3029, "60": 3030, "3980": 3031, "14251": 3032, "4063": 3033, "26018": 3034, "26487": 3035, "25899": 3036, "24344": 3037, "13283": 3038, "28205": 3039, "26726": 3040, "18436": 3041, "27470": 3042, "11940": 3043, "24909": 3044, "17309": 3045, "3033": 3046, "16006": 3047, "24191": 3048, "20393": 3049, "25845": 3050, "22458": 3051, "24557": 3052, "9742": 3053, "11412": 3054, "18150": 3055, "21293": 3056, "24714": 3057, "23865": 3058, "12257": 3059, "19664": 3060, "10014": 3061, "16992": 3062, "22314": 3063, "19874": 3064, "19361": 3065, "27139": 3066, "25524": 3067, "1695": 3068, "16659": 3069, "10070": 3070, "6500": 3071, "8217": 3072, "19504": 3073, "11194": 3074, "16062": 3075, "19055": 3076, "2429": 3077, "3390": 3078, "24626": 3079, "20204": 3080, "4695": 3081, "5716": 3082, "21779": 3083, "13901": 3084, "22232": 3085, "8088": 3086, "28598": 3087, "388": 3088, "11570": 3089, "14078": 3090, "5164": 3091, "18181": 3092, "1951": 3093, "21583": 3094, "13939": 3095, "14794": 3096, "16619": 3097, "18870": 3098, "2968": 3099, "25183": 3100, "17386": 3101, "14617": 3102, "19969": 3103, "19755": 3104, "11436": 3105, "2620": 3106, "16287": 3107, "22813": 3108, "6135": 3109, "10608": 3110, "9951": 3111, "4887": 3112, "9992": 3113, "25039": 3114, "26932": 3115, "6335": 3116, "15868": 3117, "29079": 3118, "29403": 3119, "12657": 3120, "21772": 3121, "24176": 3122, "29655": 3123, "20707": 3124, "27693": 3125, "23149": 3126, "24479": 3127, "6537": 3128, "12937": 3129, "8510": 3130, "1936": 3131, "7136": 3132, "1934": 3133, "22344": 3134, "18675": 3135, "23416": 3136, "29684": 3137, "851": 3138, "29844": 3139, "5312": 3140, "12814": 3141, "20471": 3142, "3431": 3143, "28787": 3144, "5548": 3145, "12499": 3146, "4760": 3147, "1707": 3148, "7544": 3149, "12747": 3150, "19026": 3151, "28607": 3152, "9693": 3153, "19193": 3154, "4108": 3155, "8774": 3156, "9323": 3157, "2374": 3158, "27418": 3159, "22884": 3160, "8596": 3161, "12699": 3162, "11387": 3163, "13781": 3164, "4913": 3165, "14009": 3166, "27653": 3167, "16415": 3168, "26178": 3169, "16278": 3170, "15153": 3171, "21295": 3172, "14329": 3173, "16994": 3174, "18676": 3175, "5088": 3176, "24202": 3177, "6875": 3178, "1067": 3179, "7091": 3180, "28565": 3181, "12224": 3182, "29427": 3183, "1561": 3184, "12540": 3185, "11802": 3186, "5804": 3187, "19387": 3188, "20748": 3189, "13962": 3190, "28464": 3191, "14572": 3192, "27762": 3193, "10023": 3194, "6211": 3195, "13301": 3196, "16504": 3197, "4153": 3198, "21001": 3199, "19967": 3200, "23860": 3201, "29282": 3202, "12179": 3203, "18896": 3204, "2341": 3205, "19891": 3206, "6591": 3207, "20067": 3208, "14536": 3209, "2010": 3210, "12402": 3211, "10905": 3212, "24642": 3213, "2021": 3214, "13206": 3215, "21267": 3216, "13731": 3217, "24199": 3218, "26310": 3219, "11534": 3220, "28186": 3221, "10172": 3222, "20901": 3223, "16150": 3224, "18600": 3225, "28058": 3226, "28080": 3227, "15765": 3228, "18433": 3229, "25621": 3230, "22578": 3231, "9480": 3232, "337": 3233, "8004": 3234, "7352": 3235, "5703": 3236, "12016": 3237, "27966": 3238, "15918": 3239, "22421": 3240, "2417": 3241, "16726": 3242, "20263": 3243, "12827": 3244, "3392": 3245, "6833": 3246, "9262": 3247, "3313": 3248, "22075": 3249, "19164": 3250, "26445": 3251, "16833": 3252, "18446": 3253, "18524": 3254, "17151": 3255, "28336": 3256, "13647": 3257, "1628": 3258, "25317": 3259, "29387": 3260, "27853": 3261, "12800": 3262, "6090": 3263, "1562": 3264, "6927": 3265, "22099": 3266, "5755": 3267, "27179": 3268, "18569": 3269, "11284": 3270, "4180": 3271, "23524": 3272, "7147": 3273, "5603": 3274, "18906": 3275, "22426": 3276, "8419": 3277, "25222": 3278, "13987": 3279, "21553": 3280, "4236": 3281, "15396": 3282, "13502": 3283, "17838": 3284, "26598": 3285, "10336": 3286, "26369": 3287, "15867": 3288, "13836": 3289, "16223": 3290, "16405": 3291, "11201": 3292, "8059": 3293, "24328": 3294, "27971": 3295, "25649": 3296, "19335": 3297, "14736": 3298, "29143": 3299, "8330": 3300, "29605": 3301, "27583": 3302, "23554": 3303, "15175": 3304, "13189": 3305, "15947": 3306, "22154": 3307, "23716": 3308, "3866": 3309, "2163": 3310, "5377": 3311, "5313": 3312, "18117": 3313, "13336": 3314, "23759": 3315, "10383": 3316, "11693": 3317, "11896": 3318, "7952": 3319, "15611": 3320, "21088": 3321, "12888": 3322, "2622": 3323, "16464": 3324, "28735": 3325, "14933": 3326, "12767": 3327, "14163": 3328, "23249": 3329, "8953": 3330, "12799": 3331, "2303": 3332, "18435": 3333, "29436": 3334, "1615": 3335, "4220": 3336, "22700": 3337, "9140": 3338, "3852": 3339, "13651": 3340, "8010": 3341, "3970": 3342, "15722": 3343, "428": 3344, "21471": 3345, "16088": 3346, "13756": 3347, "1690": 3348, "6427": 3349, "20116": 3350, "29025": 3351, "22401": 3352, "17756": 3353, "12691": 3354, "3297": 3355, "21871": 3356, "15805": 3357, "19892": 3358, "2697": 3359, "14462": 3360, "8642": 3361, "24769": 3362, "13423": 3363, "8744": 3364, "235": 3365, "19768": 3366, "5324": 3367, "15096": 3368, "19139": 3369, "23721": 3370, "27922": 3371, "20959": 3372, "11799": 3373, "22923": 3374, "9198": 3375, "19286": 3376, "16954": 3377, "2484": 3378, "24132": 3379, "20642": 3380, "24154": 3381, "9045": 3382, "9151": 3383, "27767": 3384, "26945": 3385, "19364": 3386, "15888": 3387, "8370": 3388, "27701": 3389, "25009": 3390, "24519": 3391, "7359": 3392, "10355": 3393, "10635": 3394, "6459": 3395, "1678": 3396, "7409": 3397, "20724": 3398, "20765": 3399, "26331": 3400, "23765": 3401, "6234": 3402, "7371": 3403, "24246": 3404, "19080": 3405, "27215": 3406, "21479": 3407, "27904": 3408, "2824": 3409, "9050": 3410, "23882": 3411, "4337": 3412, "11353": 3413, "19696": 3414, "19828": 3415, "28647": 3416, "8612": 3417, "28758": 3418, "28340": 3419, "3464": 3420, "25311": 3421, "11367": 3422, "11738": 3423, "21175": 3424, "5887": 3425, "7722": 3426, "23123": 3427, "6356": 3428, "29217": 3429, "7251": 3430, "3930": 3431, "17162": 3432, "22444": 3433, "3911": 3434, "26691": 3435, "23739": 3436, "23166": 3437, "25564": 3438, "23046": 3439, "11535": 3440, "28820": 3441, "20049": 3442, "23688": 3443, "4157": 3444, "2016": 3445, "5162": 3446, "17959": 3447, "22143": 3448, "28866": 3449, "11715": 3450, "22023": 3451, "11794": 3452, "198": 3453, "16279": 3454, "18092": 3455, "12569": 3456, "2255": 3457, "11339": 3458, "1109": 3459, "11331": 3460, "8749": 3461, "3093": 3462, "21067": 3463, "23603": 3464, "1799": 3465, "5395": 3466, "29199": 3467, "18082": 3468, "10532": 3469, "560": 3470, "11076": 3471, "812": 3472, "27290": 3473, "19709": 3474, "13495": 3475, "15082": 3476, "6284": 3477, "11285": 3478, "12213": 3479, "25700": 3480, "26604": 3481, "1449": 3482, "15302": 3483, "10984": 3484, "8852": 3485, "27840": 3486, "24317": 3487, "14026": 3488, 